Still using org credentials, now I added `hcp_project_iam_binding` to be able to update a resource. 

```hcl
provider "hcp" {
  project_id = var.project_id
}

resource "hcp_service_principal" "sp" {
  name   = "example-sp-new-name"
}

resource "hcp_project_iam_binding" "example" {
  principal_id = hcp_service_principal.sp.resource_id
  role         = "roles/contributor"
}
```

Creating them using provider's default project 
```shell
tf-help git:(main) ✗ terraform apply -var="project_id=ac8e2f32-37de-492f-9a2d-51c3b9a03089"

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # hcp_project_iam_binding.example will be created
  + resource "hcp_project_iam_binding" "example" {
      + principal_id = (known after apply)
      + role         = "roles/contributor"
    }

  # hcp_service_principal.sp will be created
  + resource "hcp_service_principal" "sp" {
      + name          = "example-sp-new-name"
      + parent        = (known after apply)
      + resource_id   = (known after apply)
      + resource_name = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

hcp_service_principal.sp: Creating...
hcp_service_principal.sp: Creation complete after 0s [name=example-sp-new-name]
hcp_project_iam_binding.example: Creating...
hcp_project_iam_binding.example: Creation complete after 1s
```

Re-applying without changing the configuration. `hcp_project_iam_binding` seems to be sensitive to provider's default project, but since `hcp_service_principal` is not: 
```shell
tf-help git:(main) ✗ terraform apply -var="project_id=82950878-75b8-464a-bb02-8d07f6083085"
hcp_service_principal.sp: Refreshing state... [name=example-sp-new-name]
hcp_project_iam_binding.example: Refreshing state...

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # hcp_project_iam_binding.example will be created
  + resource "hcp_project_iam_binding" "example" {
      + principal_id = "example-sp-new-name-023501@ac8e2f32-37de-492f-9a2d-51c3b9a03089"
      + role         = "roles/contributor"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

hcp_project_iam_binding.example: Creating...
╷
│ Error: failed to retrieve organization IAM policy
│ 
│   with hcp_project_iam_binding.example,
│   on main.tf line 98, in resource "hcp_project_iam_binding" "example":
│   98: resource "hcp_project_iam_binding" "example" {
│ 
│ [PUT /resource-manager/2019-12-10/projects/{id}/iam-policy][400] ProjectService_SetIamPolicy default  &{Code:9 Details:[] Message:failed to set IAM policy for project: not all service principals
│ in the policy are members of the org or the project}
```